Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J40.e.tmx
Source language: en_us
Languages: zh_cn

source: CHAPTER 1 The Singularity of China
zh_cn: 第一章 中国的独特性

source: SOCIETIES AND NATIONS tend to think of themselves as eternal. They also cherish a tale of their origin.
zh_cn: 一个社会或国家常认为自己将亘古永存，并对自己起源的传说备加珍视。

source: A special feature of Chinese civilization is that it seems to have no beginning.
zh_cn: 中华文明的一个特点是，它似乎没有起点。

source: It appears in history less as a conventional nation-state than a permanent natural phenomenon.
zh_cn: 中华文明不是作为一个传统意义上的民族国家，而是作为一种永恒的自然现象在历史上出现。

source: In the tale of the Yellow Emperor, revered by many Chinese as the legendary founding ruler, China seems already to exist.
zh_cn: 黄帝被很多中国人尊崇为开天辟地的第一位帝王。根据这一传说，当时中国似乎已经存在。

source: When the Yellow Emperor appears in myth, Chinese civilization has fallen into chaos.
zh_cn: 上古传说中的黄帝出现时，当时的中华文明陷入混乱。

source: Competing princes harass each other and the people, yet an enfeebled ruler fails to maintain order.
zh_cn: 各路诸侯相互攻伐，鱼肉百姓。统治者大权旁落，无力维持社会秩序。

source: Levying an army, the new hero pacifies the realm and is acclaimed as emperor.
zh_cn: 这位英雄招募军队，平定天下，被百姓拥戴为帝。黄帝于是作为中华始祖流传于世。

source: The Yellow Emperor has gone down in history as a founding hero; yet in the founding myth, he is reestablishing, not creating, an empire.
zh_cn: 然而根据有关黄帝的古代传说，他重建了而不是创建了一个帝国。早在黄帝之前，就已经有了中国。

source: China predated him; it strides into the historical consciousness as an established state requiring only restoration, not creation.
zh_cn: 在历史意识中，中国是一个只需复原，而无须创建的既有国家。

source: This paradox of Chinese history recurs with the ancient sage Confucius: again, he is seen as the “founder” of a culture although he stressed that he had invented nothing, that he was merely trying to reinvigorate the principles of harmony which had once existed in the golden age but had been lost in Confucius's own era of political chaos.
zh_cn: 中国历史的这一悖论同样体现在古代圣贤孔子身上。孔子被视为中华文化的“始祖”，尽管孔子强调说，他没有任何创新，只不过是想重振大同的理念。这种理念曾盛行于黄金时代，然而在孔子所处的政治乱世已不复存在。

source: Reflecting on the paradox of China's origins, the nineteenth-century missionary and traveler, the Abbe Regis-Evariste Huc, observed: Chinese civilization originates in an antiquity so remote that we vainly endeavor to discover its commencement.
zh_cn: 19世纪的一位传教士和旅行家凯吕斯·古伯察在思考中国起源这一悖论时评论道：中华文明源远流长，虽欲宄其渊源而不可得。

source: There are no traces of the state of infancy among this people. This is a very peculiar fact respecting China.
zh_cn: 中国人早期的生活状况邈无痕迹，此乃中国的一大特点。

source: We are accustomed in the history of nations to find some well-defined point of departure, and the historic documents, traditions, and monuments that remain to us generally permit us to follow, almost step by step, the progress of civilization, to be present at its birth, to watch its development, its onward march, and in many cases, its subsequent decay and fall.
zh_cn: 研宄一国历史时，我们习惯于先确定一个清楚的起点，然后借助流传下来的历史文献、历史传统及重大历史事件，一步步地追溯文明的衍变过程，从其起源到发展，再到壮大，直至衰亡（通常情况下）。

source: But it is not thus with the Chinese.
zh_cn: 中国人则不同。

source: They seem to have been always living in the same stage of advancement as in the present day; and the data of antiquity are such as to confirm that opinion.
zh_cn: 无论何时，他们似乎永远处于和今天相同的发展阶段。历史文献验证了这一观点。

source: When Chinese written characters first evolved, during the Shang Dynasty in the second millennium B.C., ancient Egypt was at the height of its glory.
zh_cn: 在距今3000多年的商代中国有书写文字时，古埃及正处于鼎盛时期。

source: The great city-states of classical Greece had not yet emerged, and Rome was millennia away.
zh_cn: 希腊辉煌的城邦尚未兴起。罗马帝国的建立还是1 000年以后的事。

source: Yet the direct descendant of the Shang writing system is still used by well over a billion people today.
zh_cn: 而今天有十多亿人仍在使用直接从商代延续下来的书写体系，今天的中国人可以看懂孔子时代的碑文。

source: Chinese today can understand inscriptions written in the age of Confucius; contemporary Chinese books and conversations are enriched by centuries-old aphorisms citing ancient battles and court intrigues.
zh_cn: 当代中国，无论书籍还是会话中，依然饱含从古代文化典籍中汲取的养分，例如关于战争策略和宫廷权谋的警句格言。

source: At the same time, Chinese history featured many periods of civil war, interregnum, and chaos.
zh_cn: 同时，中国历史上战乱频仍，中央政府几度荡然无存，天下大乱。

source: After each collapse, the Chinese state reconstituted itself as if by some immutable law of nature.
zh_cn: 然而仿佛受一条亘古不变的自然法则的左右，中央政权每次垮台，都会被重建。

source: At each stage, a new uniting figure emerged, following essentially the precedent of the Yellow Emperor, to subdue his rivals and reunify China (and sometimes enlarge its bounds).
zh_cn: 每个历史阶段，都有一个志在统一的人物站出来，基本上沿袭黄帝的做法，征服敌手，再次一统中国（有时是开拓疆土）。

source: The famous opening of The Romance of the Three Kingdoms, a fourteenth-century epic novel treasured by centuries of Chinese (including Mao, who is said to have pored over it almost obsessively in his youth), evokes this continuous rhythm: “The empire, long divided, must unite; long united, must divide. Thus it has ever been.”
zh_cn: 《三国演义》是一部写于14世纪的长篇历史小说，数百年来深受中国人喜爱（包括毛泽东，据说他年轻时沉迷于此书）。该书卷首的一段话脍炙人口：“话说天下大势，分久必合，合久必分。”

source: Each period of disunity was viewed as an aberration.
zh_cn: 中国的每一次分裂都被视为不正常的暂时现象。

source: Each new dynasty reached back to the previous dynasty's principles of governance in order to reestablish continuity.
zh_cn: 每次改朝换代后，新朝均沿袭前朝的治国手法，再次恢复连续性。

source: The fundamental precepts of Chinese culture endured, tested by the strain of periodic calamity.
zh_cn: 中华文化的精髓历经战祸考验，终得以延续。

source: Before the seminal event of Chinese unification in 221 B.C., there had been a millennium of dynastic rule that gradually disintegrated as the feudal subdivisions evolved from autonomy to independence.
zh_cn: 公元前221年中国的统一意义深远，此前的朝代延续了近千年。

source: The culmination was two and a half centuries of turmoil recorded in history as the Warring States period (475-221 B.C.).
zh_cn: 随着分封的诸侯从自治渐渐走向独立，周朝逐渐解体，陷入了长达250年的动乱，史称战国时期（公元前475-公元前221年）；

source: Its European equivalent would be the interregnum between the Treaty of Westphalia in 1648 and the end of the Second World War, when a multiplicity of European states was struggling for preeminence within the framework of the balance of power.
zh_cn: 相当于西方从1648年的《威斯特伐利亚和约》签订到第二次世界大战结束这段时期。其间，欧洲诸国根据均势理论互相争夺霸权。

source: After 221 B.C., China maintained the ideal of empire and unity but followed the practice of fracturing, then reuniting, in cycles sometimes lasting several hundred years.
zh_cn: 自公元前221年起，中国维系了大一统帝国的理想，然而分裂与统一的循环周而复始，有时一个周期长达数百年。

source: When the state fractured, wars between the various components were fought savagely.
zh_cn: 国家四分五裂时期，地方豪强混战不止。

source: Mao once claimed that the population of China declined from fifty million to ten million during the so-called Three Kingdoms period (A.D. 220-80) and the conflict among the contending groups between the two world wars of the twentieth century was extremely bloody as well.
zh_cn: 毛泽东曾说，三国时期（公元220-280年），中国人口从5000万减至1000万，而20世纪两次世界大战中的交战各方打得同样惨烈。

source: At its ultimate extent, the Chinese cultural sphere stretched over a continental area much larger than any European state, indeed about the size of continental Europe.
zh_cn: 古代中国疆域最大的时期，文化势力圈覆盖整个亚洲大陆，远非欧洲国家可比。

source: Chinese language and culture, and the Emperor's political writ, expanded to every known terrain: from the steppelands and pine forests in the north shading into Siberia, to the tropical jungles and terraced rice farms in the south; from the east coast with its canals, ports, and fishing villages, to the stark deserts of Central Asia and the ice-capped peaks of the Himalayan frontier.
zh_cn: 中国语言与文化以及皇帝的敕谕行及所有疆土，从北部绵延至西伯利亚的草原和森林，到南部的热带雨林和层层梯田的水乡；东部港湾密布、运河交织、渔村点点，西部有戈壁荒漠及终年冰雪的喜马拉雅山。

source: The extent and variety of this territory bolstered the sense that China was a world unto itself.
zh_cn: 疆土辽阔的中国加深了自成一体的观念：

source: It supported a conception of the Emperor as a figure of universal consequence, presiding over tian xia, or “All Under Heaven.”
zh_cn: 皇帝威加海内，“君临天下”，或者说“天下一统”。

source: The Era of Chinese Preeminence
zh_cn: 中国的强盛时期

source: Through many millennia of Chinese civilization, China was never obliged to deal with other countries or civilizations that were comparable to it in scale and sophistication.
zh_cn: 中华文明绵延数千年，中国却从未主动与其他一样幅员辽阔、历史悠久的国家或文明打过交道。

source: India was known to the Chinese, as Mao later noted, but for much of history it was divided into separate kingdoms.
zh_cn: 正如毛泽东日后所说，中国当时知道有一个印度，但历史上印度往往分裂为诸多王国。

source: The two civilizations exchanged goods and Buddhist influences along the Silk Road but were elsewhere walled off from casual contact by the almost impenetrable Himalayas and the Tibetan Plateau.
zh_cn: 中印两大文明通过丝绸之路交易商品，传播佛教思想，然而几乎难以逾越的喜马拉雅山脉和青藏高原阻隔了两国之间更密切的交往。

source: The massive and forbidding deserts of Central Asia separated China from the Near Eastern cultures of Persia and Babylonia and even more from the Roman Empire.
zh_cn: 中亚无垠的荒漠隔断了中国文化与波斯和巴比伦近东文化的交流，更不要说罗马帝国了。

source: Trade caravans undertook intermittent journeys, but China as a society did not engage societies of comparable scale and achievement.
zh_cn: 中国与他国之间时有商队往来，但作为一个社会，中国似乎不需要与同样幅员辽阔、文化发达的社会接触。

source: Though China and Japan shared a number of core cultural and political institutions, neither was prepared to recognize the other's superiority; their solution was to curtail contact for centuries at a time.
zh_cn: 尽管当时的中国和日本具有同样的文化内核及政治制度，但却彼此相轻，它们处理彼此关系的方法就是减少往来，几百年一直如此。

source: Europe was even further away in what the Chinese considered the Western Oceans, by definition inaccessible to Chinese culture and pitiably incapable of acquiring it—as the Emperor told a British envoy in 1793.
zh_cn: 正如1793年中国皇帝对一位英国使者所说，既然是西洋，中国文化自然鞭长莫及。

source: As early as the Song Dynasty (960-1279), China led the world in nautical technology; its fleets could have carried the empire into an era of conquest and exploration.
zh_cn: 在宋朝（公元960-1279年），中国的航海技术即居世界之首，其舰队本可以将中国带入一个探险和征服的时代。

source: Yet China acquired no overseas colonies and showed relatively little interest in the countries beyond its coast.
zh_cn: 然而中国没有攫取海外殖民地，对大海另一边的诸国并无探知的兴趣。

source: It developed no rationale for venturing abroad to convert the barbarians to Confucian principles or Buddhist virtues.
zh_cn: 中国也没有提出过跋涉重洋向未开化之地推行儒家学说或佛教的理论。

source: When the conquering Mongols commandeered the Song fleet and its experienced captains, they mounted two attempted invasions of Japan. Both were turned back by inclement weather—the kamikaze (or “Divine Wind”) of Japanese lore.
zh_cn: 元朝蒙古人曾凭借宋朝遗留的舰队及其经验丰富的船长两次试图到达日本，每次均因天气恶劣——日本人所谓的神风——无功而返。

source: Yet when the Mongol Dynasty collapsed, the expeditions, though technically feasible, were never again attempted.
zh_cn: 尽管远征日本是可行的，然而元朝灭亡后，中国再未作过尝试。

source: No Chinese leader ever articulated a rationale for why China would want to control the Japanese archipelago.
zh_cn: 没有一位中国当政者提出过中国应控制日本列岛的理由。

source: But in the early years of the Ming Dynasty, between 1405 and 1433, China launched one of history's most remarkable and mysterious naval enterprises: Admiral Zheng He set out in fleets of technologically unparalleled “treasure ships” to destinations as far as Java, India, the Horn of Africa, and the Strait of Hormuz.
zh_cn: 但公元1405-1433年明代初期，中国开始了历史上最壮观、最神秘的航海之旅。郑和统率技术上最先进的“宝船”舰队出洋，远至爪哇、印度、非洲之角和霍尔木兹海峡。

source: At the time of Zheng's voyages, the European age of exploration had not yet begun.
zh_cn: 郑和下西洋时，欧洲的探险时代尚未开始。

source: China's fleet possessed what would have seemed an unbridgeable technological advantage: in the size, sophistication, and number of its vessels, it dwarfed the Spanish Armada (which was still 150 years away).
zh_cn: 中国的舰队拥有似乎难以超越的技术优势，无论舰船尺寸、技术水平还是舰船数量，均令西班牙的无敌舰队（尚是150年以后的事）相形见绌。

source: Historians still debate the actual purpose of these missions.
zh_cn: 时至今日，历史学家对郑和下西洋的确切目的依然存在争论。

source: Zheng He was a singular figure in the age of exploration: a Chinese Muslim eunuch conscripted into imperial service as a child, he fits no obvious historical precedent.
zh_cn: 郑和是探险时代的一位杰出人士。他是回族人，幼年入宫，历史上很难找到有类似经历的人。

source: At each stop on his journeys, he formally proclaimed the magnificence of China's new Emperor, bestowed lavish gifts on the rulers he encountered, and invited them to travel in person or send envoys to China.
zh_cn: 航海期间，郑和每到一地，便宣示中国当朝皇帝的德威，厚赠遇到的君主，邀请他们或亲赴中国，或派遣使者访华；

source: There, they were to acknowledge their place in the Sinocentric world order by performing the ritual “kowtow” to acknowledge the Emperor's superiority.
zh_cn: 让他们通过行叩头礼的方式认可自己在以中国为中心的世界秩序中的位置，承认皇帝的至尊地位。

source: Yet beyond declaring China's greatness and issuing invitations to portentous ritual, Zheng He displayed no territorial ambition.
zh_cn: 然而，除了举行庄重的仪典炫示中国的伟大外，郑和对开疆拓土似乎并没有多少兴趣。

source: He brought back only gifts, or “tribute”; he claimed no colonies or resources for China beyond the metaphysical bounty of extending the limits of All Under Heaven.
zh_cn: 他带回国的不过是礼物，即“贡品”。

source: At most he can be said to have created favorable conditions for Chinese merchants, through a kind of early exercise of Chinese “soft power.”
zh_cn: 除了为天朝扬威这一抽象成果外，郑和没有为中国攫取领土或资源，充其量不过是较早地运用中国的“软实力”，为中国的商人创造了良好条件。

source: Zheng He's expeditions stopped abruptly in 1433, coincident with the recurrence of threats along China's northern land frontier.
zh_cn: 1433年，郑和的航海活动突然结束，当时正值中国北部边患再起。

source: The next Emperor ordered the fleet dismantled and the records of Zheng He's voyages destroyed. The expeditions were never repeated.
zh_cn: 新皇帝下令解散舰队，销毁郑和的航海记录，此后中国人再没有下过西洋。

source: Though Chinese traders continued to ply the routes Zheng He sailed, China's naval abilities faded— so much so that the Ming rulers' response to the subsequent menace of piracy off China's southeast coast was to attempt a forced migration of the coastal population ten miles inland.
zh_cn: 虽然中国的商人继续沿着郑和昔日航行过的海路往来穿梭，但中国的航海能力却日益衰微，以至于中国南部沿海地区面临海盗侵扰时，明朝的统治者竟想强迫沿海居民向内陆迀移10英里。

source: China's naval history was thus a hinge that failed to swing: technically capable of dominance, China retired voluntarily from the field of naval exploration just as Western interest was beginning to take hold.
zh_cn: 中国的航海史就这样成了一片生了锈的合叶。就在西方对航海兴趣日浓之时，有能力称雄海上的中国却自愿放弃了航海事业。

source: China's splendid isolation nurtured a particular Chinese self-perception.
zh_cn: 中国的光荣孤立在人类历史上独一无二，酝酿了一种独特的中国自我意识。

source: Chinese elites grew accustomed to the notion that China was unique—not just “a great civilization” among others, but civilization itself.
zh_cn: 中国的精英阶层逐渐习惯于认为，中国举世无双，不仅是世界诸文明中的“一个伟大文明”，更是文明的化身。

source: A British translator wrote in 1850:
zh_cn: 1850年，一位英国翻译家写道：

source: An intelligent European, accustomed to reflect on the state of a number of countries enjoying a variety of different advantages, and laboring each under peculiar disadvantages, could, by a few well directed questions, and from very little data, form a tolerably correct notion of the state of a people hitherto unknown to him; but it would be a great error to suppose that this is the case with the Chinese.
zh_cn: 一个聪慧的欧洲人，如果习惯于思考一些国家的优势和不足，只要提出几个问题，即便不掌握什么数据，也可对一个他此前并不了解的国家的人民有一个大致不错的认识。但若以为这一点也适用于中国，则大谬不然。

source: Their exclusion of foreigners and confinement to their own country has, by depriving them of all opportunities of making comparisons, sadly circumscribed their ideas; they are thus totally unable to free themselves from the dominion of association, and judge everything by rules of purely Chinese convention.
zh_cn: 对外国的排斥加上本国的封闭导致中国人根本没有比较的机会，这可悲地禁锢了他们的思想，使中国人完全无力挣脱自己的生存环境，评判任何事情皆套用中国的传统观念。

source: China knew, of course, of different societies around its periphery in Korea, Vietnam, Thailand, Burma; but in the Chinese perception, China was considered the center of the world, the “Middle Kingdom,” and other societies were assessed as gradations from it.
zh_cn: 对周边的朝鲜、越南、泰国和緬甸等国，中国当然有所闻。但在中国人心目中，中国乃世界中心，是为“中国”，其他国家皆是中国文化的变种。

source: As the Chinese saw it, a host of lesser states that imbibed Chinese culture and paid tribute to China's greatness constituted the natural order of the universe.
zh_cn: 中国人认为，吸收了中国文化、向中国朝贡的其他小国构成了宇宙的自然秩序。

source: The borders between China and the surrounding peoples were not so much political and territorial demarcations as cultural differentiations.
zh_cn: 中国与周边国家的疆界与其说是政治和领土的分界线，不如说是文化差异的分水岭。

source: The outward radiance of Chinese culture throughout East Asia led the American political scientist Lucian Pye to comment famously that, in the modern age, China remains a “civilization pretending to be a nation-state.”
zh_cn: 中国文化的辐射圈涵盖整个东亚。美国政治学家白鲁恂（Lucian Pye）有一句名言：近代中国依然是“一个自诩为民族国家的文明社会”。

source: The pretensions underlying this traditional Chinese world order endured well into the modern era.
zh_cn: 支撑传统中国这一世界秩序的妄自尊大的观念一直延续到近代。

source: As late as 1863, China’s Emperor (himself a member of a “foreign” Manchu Dynasty that had conquered China two centuries earlier) dispatched a letter informing Abraham Lincoln of China’s commitment to good relations with the United States.
zh_cn: 迟至1863年， 中国的皇帝（他本人即是200年前征服了中国的“异族”——满族王族的一员） 致函林肯， 告之中国致力于保持与美国的友好关系。

source: The Emperor based his communication on the grandiloquent assurance that, “[h]aving, with reverence, received the commission from Heaven to rule the universe, we regard both the middle empire [China] and the outside countries as constituting one family, without any distinction.”
zh_cn: 他在信函中自高自大地称： “朕承天命， 抚有四海， 视中国和异邦同为一家， 彼此无异也。 ”

source: When the letter was dispatched, China had already lost two wars with the Western powers, which were busy staking out spheres of interest in Chinese territory.
zh_cn: 发此函时， 中国已经输掉了与西方列强的两场战争——西方列强正忙于在中国领土上划分势力范围。
